[
  {
    "name": "Jan Mehlhorn",
    "roles": ["Gesang", "Gitarre"],
    "image": "/members/jan.jpg",
    "link": "",
    "bio": "Seit 1983 lasse ich die Saiten meiner Gitarre glühen und habe nie aufgehört, die Bühne zu meiner zweiten Heimat zu machen. Meine musikalischen Wurzeln liegen bei den Giganten des Heavy Metal und Hard Rock - AC/DC, Motörhead, Iron Maiden, Saxon und viele mehr haben mich geprägt und treiben mich bis heute an. Mein Stil? Laut, wild und heavy - genau so, wie es sein muss.<br /><br />Wenn ich gerade mal nicht auf der Bühne stehe oder im Proberaum bin, genieße ich das Leben in vollen Zügen. Musik war schon immer mein ständiger Begleiter - ob bei meinen früheren Bands wie Phonetik, Zyklon oder Bölk oder jetzt bei Burning Dezibel'z, meiner aktuellen musikalischen Familie. Die Chemie zwischen uns passt einfach - bei uns läuft alles wie geschmiert, und das spürt man bei jedem Gig.Meine Lieblingsnummer im Moment? **Detroit Rock City** von **Kiss** - ein absoluter Klassiker, der nie alt wird. Und die anderen Jungs? Wir kennen uns aus Seilers Rockrooms, wo aus Jam-Sessions irgendwann echte Freundschaften wurden."
  },
  {
    "name": "Robert Hertel",
    "roles": ["Gesang", "Bass"],
    "image": "/members/robert.jpg",
    "link": "",
    "bio": "Musik begleitet mich seit ich vier Jahre alt bin, als ich mit dem Akkordeon angefangen habe. Gitarre, Keyboard, Schlagzeug, Bass und diverse andere Instrumente habe ich mir später selbst beigebracht. Den Bass spiele ich jetzt seit zwei Jahren.<br /><br />Mein Stil? Muss laut sein! Inspiriert werde ich von Künstlern wie Iron Maiden, Cradle of Filth, Mr. Hurley und Das Niveau. Wenn ich nicht gerade Musik mache, bleibt mir nur noch Zeit zum Atmen... und Essen.<br /><br />Ich spiele aktuell in verschiedenen Bands, darunter **Silverlake**, **Pro Musicum** und **Wunderschöne Menschen**. Die anderen Jungs habe ich in den Seilers Rock Rooms kennengelernt. Was ich an unserer Band besonders liebe? Dass einfach alle herrlich bekloppt sind.<br /><br />Mein aktueller Lieblingssong? **Meine Schnauze** von Mr. Hurley und die Pulveraffen."
  },
  {
    "name": "Michael \"Maikel Dee\" Dörste",
    "roles": ["Gesang", "Gitarre"],
    "image": "/members/micha.jpg",
    "link": "",
    "bio": "Ich bin in Altenburg geboren, aber meine Wurzeln liegen im lebhaften Dörfchen Bornshain. Musik begleitet mich seit etwa 2010 - und richtig los ging es, nachdem ich mein erstes AC/DC-Konzert erlebt habe. Von diesem Moment an wusste ich, dass Rock'n'Roll mein Weg ist.<br /><br />Meine Einflüsse? Klassiker wie AC/DC, Led Zeppelin, Airbourne, Böhse Onkelz und Black Sabbath prägen meinen Sound. Mein Stil lässt sich ganz einfach in drei Worten beschreiben: Rock And Roll - pur, direkt und kraftvoll.<br /><br />Wenn ich gerade nicht selbst Musik mache, schwirren mir trotzdem Melodien im Kopf herum, oder ich schraube an Oldtimern. Ich liebe es, Dinge zum Laufen zu bringen - sei es ein Motor oder ein neuer Song.<br /><br />Musikalisch habe ich schon einiges ausprobiert: Angefangen bei Tanzmusik in der Cocktailband Altenburg und Soundwave, bis hin zu eigenen Projekten wie Casthold und Back on Vacation. Obwohl es dort nur zu Demos gereicht hat, habe ich im September 2024 mit meinem selbstbetitelten Debütalbum als Solokünstler endlich meine Vision verwirklicht.<br /><br />Jan und Robert traf ich bei einer Jamsession in den Seilers Rockrooms Zwickau, und Luca kam über Robert dazu. Was mir an der Zusammenarbeit mit der Band am meisten gefällt? Wir ziehen alle am selben Strang und haben dabei jede Menge Spaß - genau so muss es sein.<br /><br />Mein aktueller Ohrwurm aus unserem Repertoire ist ganz klar **Balls To The Wall** - der Song bleibt einfach nach jeder Probe im Kopf hängen. Abseits davon feiere ich gerade **Invisible Horizons** von Rage - ein echter Banger, der nicht langweilig wird."
  },
  {
    "name": "Luca Hentschel",
    "roles": ["Schlagzeug"],
    "image": "/members/luca.jpg",
    "link": "",
    "bio": "Geboren in Aue, aufgewachsen in Wilkau-Haßlau und seitdem dort ansässig, begleitet mich Musik seit meinem vierten Lebensjahr. In Bands spiele ich seit ca. 2018-2019, und bei den Burning Dezibelz bin ich seit Anfang 2024 hinter den Drums am Start.<br />Meine musikalische Reise begann mit den Firebirds und ihrer Mischung aus Rockabilly und Rock 'n Roll, doch erst 2019/2020, als ich Sabaton entdeckte, wurde mir klar: Rock und Metal sind mein Ding. Trotzdem hat auch Country einen wichtigen Einfluss auf meinen Stil. Wenn ich meinen Sound in drei Worten beschreiben müsste, wären das: Schnell, Rhythmus, Power.<br /><br />Wenn ich nicht gerade trommle, verbringe ich meine Zeit mit Schule, Programmieren oder der ein oder anderen Runde Video-Games. Meine bisherige Band-Erfahrung sammelte ich vor allem in der Young-People BigBand Crimmitschau, bevor ich Anfang 2024 bei den Burning Dezibelz landete. Robert fand mich über meine Musiklehrerin, und der Rest passte einfach perfekt. Lustigerweise war ich sogar beim Debüt-Konzert der Band Ende 2023 im Publikum.<br /><br />Was ich an unserer Band liebe? Dass wir alle gut zusammenarbeiten und jeder gepflegt einen an der Waffel hat.<br />Mein Proben-Ohrwurm ist definitiv **Detroit Rock City**, aber privat höre und spiele ich alles Mögliche - am liebsten Sabaton, Smash Into Pieces, Arion, Volbeat. Rock on!"
  }
]
